declare const enum PokerId {
    DIAMOND_2  = 0x01,//方块2 (0000 0001)
	CLUB_2     = 0x11,//梅花2 (0001 0001)
	HEART_2    = 0x21,//红桃2 (0010 0001)
	SPADE_2    = 0x31,//黑桃2 (0011 0001)

	DIAMOND_3  = 0x02,//方块3 (0000 0010)
	CLUB_3     = 0x12,//梅花3 (0001 0010)
	HEART_3    = 0x22,//红桃3 (0010 0010)
	SPADE_3    = 0x32,//黑桃3 (0011 0010)

	DIAMOND_4  = 0x03,//方块4 (0000 0011)
	CLUB_4     = 0x13,//梅花4 (0001 0011)
	HEART_4    = 0x23,//红桃4 (0010 0011)
	SPADE_4    = 0x33,//黑桃4 (0011 0011)

	DIAMOND_5  = 0x04,//方块5 (0000 0100)
	CLUB_5     = 0x14,//梅花5 (0001 0100)
	HEART_5    = 0x24,//红桃5 (0010 0100)
	SPADE_5    = 0x34,//黑桃5 (0011 0100)

	DIAMOND_6  = 0x05,//方块6 (0000 0101)
	CLUB_6     = 0x15,//梅花6 (0001 0101)
	HEART_6    = 0x25,//红桃6 (0010 0101)
	SPADE_6    = 0x35,//黑桃6 (0011 0101)

	DIAMOND_7  = 0x06,//方块7 (0000 0110)
	CLUB_7     = 0x16,//梅花7 (0001 0110)
	HEART_7    = 0x26,//红桃7 (0010 0110)
	SPADE_7    = 0x36,//黑桃7 (0011 0110)

	DIAMOND_8  = 0x07,//方块8 (0000 0111)
	CLUB_8     = 0x17,//梅花8 (0001 0111)
	HEART_8    = 0x27,//红桃8 (0010 0111)
	SPADE_8    = 0x37,//黑桃8 (0011 0111)

	DIAMOND_9  = 0x08,//方块9 (0000 1000)
	CLUB_9     = 0x18,//梅花9 (0001 1000)
	HEART_9    = 0x28,//红桃9 (0010 1000)
	SPADE_9    = 0x38,//黑桃9 (0011 1000)

	DIAMOND_10  = 0x09,//方块10 (0000 1001)
	CLUB_10     = 0x19,//梅花10 (0001 1001)
	HEART_10    = 0x29,//红桃10 (0010 1001)
	SPADE_10    = 0x39,//黑桃10 (0011 1001)

	DIAMOND_J  = 0x0A,//方块J (0000 1010)
	CLUB_J     = 0x1A,//梅花J (0001 1010)
	HEART_J    = 0x2A,//红桃J (0010 1010)
	SPADE_J    = 0x3A,//黑桃J (0011 1010)

	DIAMOND_Q  = 0x0B,//方块Q (0000 1011)
	CLUB_Q     = 0x1B,//梅花Q (0001 1011)
	HEART_Q    = 0x2B,//红桃Q (0010 1011)
	SPADE_Q    = 0x3B,//黑桃Q (0011 1011)

	DIAMOND_K  = 0x0C,//方块K (0000 1100)
	CLUB_K     = 0x1C,//梅花K (0001 1100)
	HEART_K    = 0x2C,//红桃K (0010 1100)
	SPADE_K    = 0x3C,//黑桃K (0011 1100)

	DIAMOND_A  = 0x0D,//方块A (0000 1101)
	CLUB_A     = 0x1D,//梅花A (0001 1101)
	HEART_A    = 0x2D,//红桃A (0010 1101)
	SPADE_A    = 0x3D,//黑桃A (0011 1101)

	SMALL_JOKER  = 0x4E,//小王 (0100 1110)
	BIG_JOKER    = 0x4F,//大王 (0100 1111)
}